#pragma once

/*********************************************************
* 该接口定义了各类DP数据转化为标准CPS数据的统一接口格式，凡是
* 需要进行DP格式转换都需要实现下面的接口函数。
**********************************************************/

struct ICPS
{

};

/**********************************************************
* 定义该dll对外接口
***********************************************************/
#ifdef CPS_EXPORTS
#define CPS_API __declspec(dllexport)
#else
#define CPS_API __declspec(dllimport)
#endif

/*********************************************************
* 获取ICPS接口，从而调用其方法
**********************************************************/
extern "C" CPS_API ICPS* GetCPSInstance();

/*********************************************************
* 当通过GetCpsInstance()获取接口后，使用完之后需要释放该对象，
* 避免不必要的内存泄漏
**********************************************************/
extern "C" CPS_API void DeleteCPSInstance(ICPS* obj);