#pragma once
#include "IAPDU.h"
/**************************************************
* 智能卡操作接口，用于与卡片直接的通讯
**************************************************/
struct IPCSC
{
    /**********************************************
    * 功能: 获取所有读卡器插槽名称
    ***********************************************/
    virtual vector<char*> GetAllReaders() = 0;

	/**********************************************
	* 功能：打开读卡器，之后便可与智能卡通讯
	* 参数：
	*	szReaderName	读卡器插槽名称
	*	contextHandle	智能卡接口上下文环境
	* 返回：TRUE表示成功， FALSE表示失败
	***********************************************/
	virtual bool OpenReader(const char* szReaderName) = 0;

	/**********************************************
	* 功能：关闭读卡器
	***********************************************/
	virtual void CloseReader() = 0;

	/**********************************************
	* 功能： 获取与智能卡通讯的APDU指令接口
	**********************************************/
	virtual IAPDU* GetAPDU() = 0;

	/*********************************************
	* 功能： 根据AID选择应用
	* 参数： 应用AID
	* 返回： true 返回成功， false 返回失败
	**********************************************/
	virtual bool SelectAID(const string &strAID) = 0;

	/*********************************************
	* 功能： 打开安全通道
	* 参数： strKMC 个人化主控密钥
	* 返回： true 返回成功， false 返回失败
	**********************************************/
	virtual bool OpenSecureChannel(const string &strKMC) = 0;

	/*********************************************
	* 功能： 重置个人化主控密钥
	* 参数： strKMC 新的KMC主控密钥
	* 返回： true 返回成功， false 返回失败
	**********************************************/
	virtual bool SetKMC(const string &strKMC, DIV_METHOD_FLAG flag) = 0;

	/*********************************************
	* 功能： 获取ATR
	* 返回： 返回ATR字符串
	**********************************************/
	virtual string GetATR() = 0;

	/*********************************************
	* 功能：获取卡片分散方法
	* 返回：分散方法标识
	**********************************************/
	virtual DIV_METHOD_FLAG GetDIV() = 0;

	/*********************************************
	* 功能：获取卡片安全等级
	* 返回: 安全等级标识
	**********************************************/
	virtual SECURE_LEVEL GetSecureLevel() = 0;

	/*********************************************
	* 功能：获取卡片状态
	* 返回：卡片状态标识
	**********************************************/
	virtual CARD_STATUS GetCardStatus() = 0;

	/*********************************************
	* 功能：获取卡片通讯传输协议
	* 返回：传输协议标识
	**********************************************/
	virtual CARD_TRANSMISSION_PROTOCOL GetCardTransmissionProtocol() = 0;

    /************************************************
    * 功能：获取密钥版本
    *************************************************/
    virtual string GetKeyVersion() = 0;

	/************************************************
	* 功能：获取由KMC分散子密钥生成的会话密钥
	*************************************************/
	virtual string GetSessionAuthKey() = 0;
	virtual string GetSessionMacKey() = 0;
	virtual string GetSessionEncKey() = 0;

	/***********************************************
	* 功能：获取KMC 分散子密钥
	***********************************************/
	virtual string GetAuthKey() = 0;
	virtual string GetMacKey() = 0;
	virtual string GetEncKey() = 0;

	/**********************************************
	* 功能：获取上次函数操作失败的错误信息
	***********************************************/
	virtual string GetLastError() = 0;
};